d1 = {"eu20190701a": "황태맑은국,동그랑땡,연근조림,김치,사과", "eu20190701b": "여름비빔밥,두부장국,김치,미숫가루", "eu20190701c": "차조밥,콩나물국/누룽지,오리로스구이,채소모둠쌈,두반장부추무침,김치2"}

d2 = {"eu20190701a": "황태맑은국,동그랑땡,연근조림,김치,사과", "eu20190701b": "여름비빔밥,두부장국,김치,미숫가루", "eu20190701c": "차조밥,콩나물국/누룽지,오리로스구이,채소모둠쌈,두반장부추무침,김치", "eu20190702a": "크림치즈프레즐,캐롯크림스프,토마토,쥬스", "eu20190702b": "율무밥,미역고추장수제비국,감자소시지버터구이,오뱅이무침,김치,아이스크림"}

# print(d2 - d1)

print(set(d1.values()))
print(set(d2.values()))
print("\n**--**")
print(set(d2.values())-set(d1.values()))